{"keras_version": "2.0.5", "config": [{"config": {"dilation_rate": [1, 1], "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "filters": 64, "strides": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "batch_input_shape": [null, 50, 50, 3], "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [16, 16]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 64, "strides": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [8, 8]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 64, "strides": [1, 1], "name": "conv2d_3", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_regularizer": null, "units": 128, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_regularizer": null, "units": 2, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}